src/cf/InformationRegisters/ПодключенияККлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПодключенияККлиенту</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПодключений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ITC_ПодключенияСервер/Ext/Module.bsl
Функция ПолучитьДанныеПодключения(ъКлиент, ъИмя, ъВидПодключения) Экспорт
	
	яЗ = Новый Запрос(
	"ВЫБРАТЬ
	|	ПодключенияККлиенту.ВидПодключения КАК ВидПодключения,
	|	ПодключенияККлиенту.Адрес КАК Адрес,
	|	ПодключенияККлиенту.Логин КАК Логин,
	|	ПодключенияККлиенту.Пароль КАК Пароль,
	|	ПодключенияККлиенту.Название КАК Название
	|ИЗ
	|	РегистрСведений.ПодключенияККлиенту КАК ПодключенияККлиенту
	|ГДЕ
	|	ПодключенияККлиенту.Клиент = &Клиент
	|	И ПодключенияККлиенту.Название = &Название
	|	И ПодключенияККлиенту.ВидПодключения = &ВидПодключения");
	яЗ.УстановитьПараметр("Клиент", ъКлиент);	
	яЗ.УстановитьПараметр("Название", ъИмя);
	яЗ.УстановитьПараметр("ВидПодключения", ъВидПодключения);
	
	яС = Новый Структура("Название,ВидПодключения,Адрес,Логин,Пароль");
	
	яВ = яЗ.Выполнить().Выбрать();
	Если яВ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(яС, яВ);
	КонецЕсли;
	
	Возврат яС;
	
	
КонецФункции


Функция ВернутьМакет(ъИмя) Экспорт
	
	Возврат ITC_ОбщиеСервер.ПолучитьОбщийМакетНаСервере(ъИмя);
	
КонецФункции



Функция ВернутьПутьИсполняемыйФайл(ъВидПодключения) Экспорт
	
	Возврат ъВидПодключения.ПутьИсполняемыйФайл;
	
КонецФункции
